\section{IPv6}
This chapter describes how to configure IPv6.

\subsection{IPv6 Autoconfiguration}
\begin{textbox}{gray}{NOTE}
Autoconfiguration requires te leas amount of configuration but makes it difficult to remember the IPv6 addresses.
This method uses the MAC address of the device to create an IPv6 address with the \verb!FE80::! prefix.
\end{textbox}
Begin by configuring the router. Enter the interface configuration mode and enable IPv6 on the interface.
\begin{verbatim}
R1(config)# ipv6 unicast-routing
R1(config)# interface FastEthernet0/0
R1(config-if)# ipv6 enable
\end{verbatim}
Next, configure a link local address and a global unicast address on the interface. This example uses \verb!eui-64! to reduce the configuration.
\begin{verbatim}
R1(config-if)# ipv6 address autoconfig
R1(config-if)# ipv6 add 2000::/64 eui-64
R1(config-if)# no shutdown
\end{verbatim}
Verify the interface is \textit{up} and has two IPv6 addresses.
\begin{verbatim}
R1>show ipv6 interface brief
\end{verbatim}

\subsection{IPv6 Static}
Begin by configuring a static IPv6 address on the router
\begin{verbatim}
R1(config)# ipv6 unicast-routing
R1(config)# interface FastEthernet0/0
R1(config-if)# ipv6 enable
R1(config-if)# 2000::1/64
R1(config-if)# no shutdown
\end{verbatim}

\subsection{IPv6 Static Routing}
Configuration commands for its static routing are similar to IPv4.
\begin{verbatim}
R1(config)# ipv6 unicast-routing
R1(config)# ipv6 route 2000:2::/64 2001::20
\end{verbatim}

\subsection{IPv6 Dynamic Routing}
\begin{verbatim}
R1(config)# interface FastEthernet0/0
R1(config-if)# ipv6 address 2000:1::1/64
R1(config-if)# ipv6 rip Net1 enable
R1(config-if)# ipv6 enable
R1(config-if)# interface FastEthernet0/1
R1(config-if)# ipv6 address 2001::10/64
R1(config-if)# ipv6 rip Net1 enable
R1(config-if)# ipv6 enable
\end{verbatim}
